КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/КонтурЛогистика_ПроизвольныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ПроизвольныеДанные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Из какого объекта произошла конвертация</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКонвертацииРС</name>
    <comment>Какая НКРС использовалась при синх. в 1С</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииРегистровСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияССервисом</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияСОбъектом1С</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез1</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез2</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез2</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез3</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ПодпискиИОплатаСервер/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует табличный документ со сведениями о подписках и оплате авторизованных организаций.
//
// Параметры:
//  ОрганизацияОтбор - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок, Неопределено -
//                     если заполнено, данные только по указанной организации
//
// Возвращаемое значение:
//  ТабличныйДокумент
//
Функция СформироватьТабличныйДокументПодписокИОплаты(ОрганизацияОтбор = Неопределено) Экспорт
	
	Если Не ПодпискиИОплатаДоступны() Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	ДанныеОрганизаций = ПолучитьДанныеАвторизованныхОрганизаций(ОрганизацияОтбор);
	ОтсортироватьДанныеОрганизацийДляОтображения(ДанныеОрганизаций);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.АвтоМасштаб = Истина;
	
	УстановитьШиринуКолонокТабличногоДокументаПодписок(ТабДок);
	
	ОбразецСтроки = ОбразецСтрокиТабличногоДокументаПодписок();
	
	Если ДанныеОрганизаций.Количество() = 0 Тогда
		
		ОчиститьОбразецСтрокиТабличногоДокументаПодписок(ОбразецСтроки);
		ЗаполнитьТекстОбразцаСтроки(ОбразецСтроки, 1, 5, "Нет авторизованных организаций для отображения сведений.");
		ТабДок.Вывести(ОбластьОбразцаСтроки(ОбразецСтроки));
		
	Иначе
		
		ТабДок.НачатьАвтогруппировкуСтрок();
		
		ПервыйБлокОрганизации = Истина;
		
		Для Каждого СтрокаДанных Из ДанныеОрганизаций Цикл
			
			Если Не ПервыйБлокОрганизации Тогда
				ВывестиПустуюСтрокуМеждуБлокамиОрганизаций(ТабДок, ОбразецСтроки);
			КонецЕсли;
			
			ВывестиБлокОрганизацииВТабличныйДокумент(ТабДок, ОбразецСтроки, СтрокаДанных);
			ПервыйБлокОрганизации = Ложь;
			
		КонецЦикла;
		
		ТабДок.ЗакончитьАвтогруппировкуСтрок();
		ТабДок.ПоказатьУровеньГруппировокСтрок(1);
		
	КонецЕсли;
	
	ОчиститьОбразецСтрокиТабличногоДокументаПодписок(ОбразецСтроки);
	ТабДок.Вывести(ОбластьОбразцаСтроки(ОбразецСтроки));
	ВывестиПодвалПомощиВТабличныйДокумент(ТабДок, ОбразецСтроки);
	
	Возврат ТабДок;
	
КонецФункции

// Возвращает URL продления лицензии модуля в KStore.
//
// Возвращаемое значение:
//  Строка
//
Функция СсылкаПродленияЛицензии() Экспорт
	
	Возврат "https://online-sales.kontur.ru/sale?tariffs=logistics_integration_12&scenarioId=logistics_sale";
	
КонецФункции

// Возвращает URL оплаты пакета документов.
//
// Возвращаемое значение:
//  Строка
//
Функция СсылкаОплатыПакетаДокументов() Экспорт
	
	Возврат "https://kontur.ru/logistika/price";
	
КонецФункции

// Определяет, используется ли функциональность подписок и оплаты в текущем окружении.
// На тестовом сервере Диадок сведения не запрашиваются и не отображаются.
//
// Возвращаемое значение:
//  Булево
//
Функция ПодпискиИОплатаДоступны() Экспорт
	
	Возврат Не ИспользуетсяТестовыйСерверДиадокДляПодписокИОплаты();
	
КонецФункции

// Определяет, следует ли исключить организацию из подписок и оплаты.
//
// Параметры:
//  Организация - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок
//
// Возвращаемое значение:
//  Булево
//
Функция ОрганизацияИсключенаИзПодписокИОплаты(Организация) Экспорт
	
	Возврат Не ПодпискиИОплатаДоступны()
		Или ОрганизацияДиадокТестовая(Организация);
	
КонецФункции

// Возвращает список наших организаций с выполненной авторизацией в сервисе.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок
//
Функция АвторизованныеОрганизации() Экспорт
	
	Результат = Новый Массив;
	
	Если Не ПодпискиИОплатаДоступны() Тогда
		Возврат Результат;
	КонецЕсли;
	
	НашиОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	
	Для Каждого Организация Из НашиОрганизации Цикл
		
		Если ОрганизацияДиадокТестовая(Организация) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Организация);
		
		Если ПараметрыСервиса.АвторизацияВыполнена Тогда
			Результат.Добавить(Организация);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает сведения о необходимости показать баннер проблем с оплатой на рабочем столе.
// Оценка выполняется по данным регистра КонтурЛогистика_ПроизвольныеДанные (ПодпискиИОплата)
// для авторизованных организаций. Выбирается один сценарий с наивысшим приоритетом (1 — наивысший).
//
// Возвращаемое значение:
//  Структура:
//   * ЕстьПроблемы - Булево
//   * ТекстПроблемы - Строка
//
Функция ПолучитьСведенияОПроблемахОплатыДляБаннера() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьПроблемы", Ложь);
	Результат.Вставить("ТекстПроблемы", "");
	
	Если Не Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ВыводитьБаннерПроблемСОплатой") Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеОрганизаций = ПолучитьДанныеАвторизованныхОрганизаций();
	ОрганизацииПоПриоритету = ИнициализироватьОрганизацииПоПриоритетуПроблем();
	
	Для Каждого СтрокаДанных Из ДанныеОрганизаций Цикл
		
		Если ЗначениеЗаполнено(СтрокаДанных.ТекстОшибки) Тогда
			ЗарегистрироватьМетрикуОшибкиБаннераПодписокИОплаты(СтрокаДанных);
		КонецЕсли;
		
		Если Не ДанныеБиллингаОрганизацииДоступны(СтрокаДанных) Тогда
			Продолжить;
		КонецЕсли;
		
		ПриоритетПроблемы = ПриоритетПроблемыОплатыОрганизации(СтрокаДанных.ДанныеБиллинга);
		
		Если ПриоритетПроблемы = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОрганизацииСценария = ОрганизацииПоПриоритету.Получить(ПриоритетПроблемы);
		ОрганизацииСценария.Добавить(СтрокаДанных.Организация);
		
	КонецЦикла;
	
	Для ПриоритетПроблемы = 1 По 7 Цикл
		
		ОрганизацииСценария = ОрганизацииПоПриоритету.Получить(ПриоритетПроблемы);
		
		Если ОрганизацииСценария.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.ЕстьПроблемы = Истина;
		Результат.ТекстПроблемы = ТекстПроблемыОплатыПоСценарию(ПриоритетПроблемы,
			ПредставленияОрганизацийДляТекстаБаннера(ОрганизацииСценария));
		ЗарегистрироватьМетрикуПоказаБаннераПодписокИОплаты(ПриоритетПроблемы, ОрганизацииСценария);
		Прервать;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет актуальность сведений о подписках авторизованных организаций в регистре
// и при необходимости запускает их синхронизацию в фоне.
//
// Возвращаемое значение:
//  Структура:
//   * ТребуетсяОбновление - Булево
//   * Статус - Строка - Выполняется, Выполнено, Ошибка
//   * ИдентификаторЗадания - УникальныйИдентификатор, Неопределено
//
Функция ПроверитьОбновитьСведенияОПодписках() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ТребуетсяОбновление", Ложь);
	Результат.Вставить("Статус", "");
	Результат.Вставить("ИдентификаторЗадания", Неопределено);
	
	Если Не ПодпискиИОплатаДоступны() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОрганизацииДляОбновления = ОрганизацииТребующиеОбновленияСведенийОПодписках();
	
	Если ОрганизацииДляОбновления.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.ТребуетсяОбновление = Истина;
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("МассивОрганизаций", ОрганизацииДляОбновления);
	
	РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьВФоне(
		"КонтурЛогистика_ДлительныеОперацииСервер.СинхронизироватьДанныеПодписокИОплаты",
		ПараметрыФоновогоЗадания,
		"СинхронизацияПодписокИОплаты",
		"Синхронизация данных подписок и оплаты (ТихийРежим)");
	
	Результат.Статус = РезультатЗапуска.Статус;
	Результат.ИдентификаторЗадания = РезультатЗапуска.ИдентификаторЗадания;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуетсяТестовыйСерверДиадокДляПодписокИОплаты()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок") = Истина;
	
КонецФункции

Функция ОрганизацияДиадокТестовая(Организация)
	
	Тестовая = КонтурЛогистика_СтдОбщегоНазначения.ЗначениеРеквизитаОбъектаЛок(Организация, "Тестовая");
	
	Возврат Тестовая = Истина;
	
КонецФункции

Функция СрокАктуальностиСведенийОПодпискахСекунды()
	
	Возврат 4 * 60 * 60;
	
КонецФункции

Функция СведенияОПодпискахУстарели(ДатаАктуальности)
	
	Если Не ЗначениеЗаполнено(ДатаАктуальности) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТекущийМомент = КонтурЛогистика_ОбщегоНазначенияСервер.ТекущийМоментВремениМСК();
	РазностьСекунд = ТекущийМомент - ДатаАктуальности;
	
	Возврат РазностьСекунд > СрокАктуальностиСведенийОПодпискахСекунды();
	
КонецФункции

Функция ОрганизацииТребующиеОбновленияСведенийОПодписках()
	
	Результат = Новый Массив;
	АвторизованныеОрганизации = АвторизованныеОрганизации();
	
	Если АвторизованныеОрганизации.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеРегистра = ПолучитьДанныеРегистраПоОрганизациям(АвторизованныеОрганизации);
	
	Для Каждого Организация Из АвторизованныеОрганизации Цикл
		
		ДанныеЗаписи = ДанныеРегистра.Получить(Организация);
		
		Если ДанныеЗаписи = Неопределено Тогда
			Результат.Добавить(Организация);
			Продолжить;
		КонецЕсли;
		
		Если СведенияОПодпискахУстарели(ДанныеЗаписи.ДатаАктуальности) Тогда
			Результат.Добавить(Организация);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеАвторизованныхОрганизаций(ОрганизацияОтбор = Неопределено)
	
	ДанныеОрганизаций = Новый Массив;
	
	Если Не ПодпискиИОплатаДоступны() Тогда
		Возврат ДанныеОрганизаций;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОрганизацияОтбор)
		И ОрганизацияИсключенаИзПодписокИОплаты(ОрганизацияОтбор) Тогда
		Возврат ДанныеОрганизаций;
	КонецЕсли;
	
	АвторизованныеОрганизации = АвторизованныеОрганизации();
	
	Если АвторизованныеОрганизации.Количество() = 0 Тогда
		Возврат ДанныеОрганизаций;
	КонецЕсли;
	
	ОрганизацииДляОтображения = Новый Массив;
	
	Если ЗначениеЗаполнено(ОрганизацияОтбор) Тогда
		
		Для Каждого Организация Из АвторизованныеОрганизации Цикл
			
			Если Организация = ОрганизацияОтбор Тогда
				ОрганизацииДляОтображения.Добавить(Организация);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Организация Из АвторизованныеОрганизации Цикл
			ОрганизацииДляОтображения.Добавить(Организация);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ОрганизацииДляОтображения.Количество() = 0 Тогда
		Возврат ДанныеОрганизаций;
	КонецЕсли;
	
	ДанныеРегистра = ПолучитьДанныеРегистраПоОрганизациям(ОрганизацииДляОтображения);
	
	Для Каждого Организация Из ОрганизацииДляОтображения Цикл
		
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("Организация", Организация);
		СтрокаДанных.Вставить("ПредставлениеОрганизации", Строка(Организация));
		СтрокаДанных.Вставить("ДатаАктуальности", Дата(1, 1, 1));
		СтрокаДанных.Вставить("ТекстОшибки", "");
		СтрокаДанных.Вставить("ЕстьЗапись", Ложь);
		СтрокаДанных.Вставить("ДанныеБиллинга", КонтурЛогистика_API_Логистика.МанифестДанныхБиллингаОрганизации());
		
		ДанныеЗаписи = ДанныеРегистра.Получить(Организация);
		
		Если ДанныеЗаписи <> Неопределено Тогда
			
			СтрокаДанных.ЕстьЗапись = Истина;
			СтрокаДанных.ДатаАктуальности = ДанныеЗаписи.ДатаАктуальности;
			СтрокаДанных.ТекстОшибки = ДанныеЗаписи.ТекстОшибки;
			СтрокаДанных.ДанныеБиллинга = ДанныеЗаписи.ДанныеБиллинга;
			
		КонецЕсли;
		
		ДанныеОрганизаций.Добавить(СтрокаДанных);
		
	КонецЦикла;
	
	Возврат ДанныеОрганизаций;
	
КонецФункции

Функция ПолучитьДанныеРегистраПоОрганизациям(Организации)
	
	Результат = Новый Соответствие;
	
	Если Организации.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТипДанных = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ПодпискиИОплата;
	ПустойРазрез2 = Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("Разрез2", ПустойРазрез2);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок КАК ОрганизацияДиадок,
	|	КонтурЛогистика_ПроизвольныеДанные.Дата КАК ДатаАктуальности,
	|	КонтурЛогистика_ПроизвольныеДанные.ТекстОшибки КАК ТекстОшибки,
	|	КонтурЛогистика_ПроизвольныеДанные.ДанныеХранилище КАК ДанныеХранилище
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|ГДЕ
	|	КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок В (&Организации)
	|	И КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез1 = """"
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &Разрез2
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез3 = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаДанных = Новый Структура;
		СтрокаДанных.Вставить("ДатаАктуальности", Выборка.ДатаАктуальности);
		СтрокаДанных.Вставить("ТекстОшибки", Выборка.ТекстОшибки);
		СтрокаДанных.Вставить("ДанныеБиллинга", РазобратьДанныеБиллингаИзХранилища(Выборка.ДанныеХранилище));
		
		Результат.Вставить(Выборка.ОрганизацияДиадок, СтрокаДанных);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РазобратьДанныеБиллингаИзХранилища(ДанныеХранилище)
	
	Результат = КонтурЛогистика_API_Логистика.МанифестДанныхБиллингаОрганизации();
	
	Если Не ЗначениеЗаполнено(ДанныеХранилище) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Данные = ДанныеХранилище.Получить();
	
	Если Данные = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Возврат Данные;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИнициализироватьОрганизацииПоПриоритетуПроблем()
	
	Результат = Новый Соответствие;
	
	Для ПриоритетПроблемы = 1 По 7 Цикл
		Результат.Вставить(ПриоритетПроблемы, Новый Массив);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеБиллингаОрганизацииДоступны(СтрокаДанных)
	
	Если Не СтрокаДанных.ЕстьЗапись Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеБиллинга = СтрокаДанных.ДанныеБиллинга;
	
	Если Не ДанныеБиллинга.Успешно Или ДанныеБиллинга.ИнформацияНедоступна Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПриоритетПроблемыОплатыОрганизации(ДанныеБиллинга)
	
	ЛицевойСчет = ДанныеБиллинга.ЛицевойСчет;
	Лицензия = ДанныеБиллинга.Лицензия;
	Пакет = ДанныеБиллинга.ПакетДокументов;
	
	Если ЛицевойСчетПроблемный(ЛицевойСчет) Тогда
		Возврат 1;
	КонецЕсли;
	
	Если Не Лицензия.ЕстьЛицензия Или Лицензия.НеДействует Тогда
		Возврат 2;
	КонецЕсли;
	
	ПриоритетПакета = ПриоритетПроблемыПакетаДокументов(Пакет);
	
	Если ПриоритетПакета = 3 Или ПриоритетПакета = 4 Тогда
		Возврат ПриоритетПакета;
	КонецЕсли;
	
	Если Лицензия.ДнейДоОкончания <= 45 И Лицензия.ДнейДоОкончания >= 0 Тогда
		Возврат 5;
	КонецЕсли;
	
	Если ПриоритетПакета > 0 Тогда
		Возврат ПриоритетПакета;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Возвращает приоритет проблемы по пакету документов (сценарии 3, 4, 6, 7) либо 0.
//
Функция ПриоритетПроблемыПакетаДокументов(Пакет)
	
	Если Не Пакет.ЕстьПакет Тогда
		Возврат 3;
	КонецЕсли;
	
	Если Пакет.Исчерпан Тогда
		Возврат 4;
	КонецЕсли;
	
	Если Пакет.Остаток > 0 И Пакет.Остаток <= 50 Тогда
		Возврат 6;
	КонецЕсли;
	
	Если Пакет.ДнейДоОкончания <= 20 И Пакет.ДнейДоОкончания >= 0 Тогда
		Возврат 7;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЛицевойСчетПроблемный(ЛицевойСчет)
	
	Возврат ЛицевойСчет.Заблокирован
		Или Не ЗначениеЗаполнено(ЛицевойСчет.AccountId);
	
КонецФункции

Функция ТекстПроблемыОплатыПоСценарию(ПриоритетПроблемы, Организации)
	
	ПредставлениеОрганизаций = КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(Организации, ", ");
	
	Если ПриоритетПроблемы = 1 Тогда
		Возврат КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("Лицевой счет %1 заблокирован", ПредставлениеОрганизаций);
	ИначеЕсли ПриоритетПроблемы = 2 Тогда
		Возврат КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("Лицензия на модуль 1С: Логистика отсутствует для %1", ПредставлениеОрганизаций);
	ИначеЕсли ПриоритетПроблемы = 3 Тогда
		Возврат КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("Отсутствует доступный пакет документов для %1", ПредставлениеОрганизаций);
	ИначеЕсли ПриоритетПроблемы = 4 Тогда
		Возврат КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("Пакет документов закончился для %1", ПредставлениеОрганизаций);
	ИначеЕсли ПриоритетПроблемы = 5 Тогда
		Возврат КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("Заканчивается оплаченный период лицензии на модуль 1С: Логистика для %1",
			ПредставлениеОрганизаций);
	ИначеЕсли ПриоритетПроблемы = 6 Тогда
		Возврат КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("Пакет документов заканчивается для %1", ПредставлениеОрганизаций);
	ИначеЕсли ПриоритетПроблемы = 7 Тогда
		Возврат КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("Истекает срок действия пакета документов для %1", ПредставлениеОрганизаций);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция РасшифровкаЦентраПоддержки()
	
	Возврат "ЦентрПоддержки";
	
КонецФункции

Процедура ОтсортироватьДанныеОрганизацийДляОтображения(ДанныеОрганизаций)
	
	Если ДанныеОрганизаций.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Для Индекс1 = 0 По ДанныеОрганизаций.ВГраница() - 1 Цикл
		
		Для Индекс2 = Индекс1 + 1 По ДанныеОрганизаций.ВГраница() Цикл
			
			Приоритет1 = ПриоритетСортировкиОрганизации(ДанныеОрганизаций[Индекс1]);
			Приоритет2 = ПриоритетСортировкиОрганизации(ДанныеОрганизаций[Индекс2]);
			
			НужноПоменятьМестами = Приоритет2 < Приоритет1;
			
			Если Не НужноПоменятьМестами И Приоритет2 = Приоритет1 Тогда
				НужноПоменятьМестами = ДанныеОрганизаций[Индекс2].ПредставлениеОрганизации
					< ДанныеОрганизаций[Индекс1].ПредставлениеОрганизации;
			КонецЕсли;
			
			Если НужноПоменятьМестами Тогда
				
				Временное = ДанныеОрганизаций[Индекс1];
				ДанныеОрганизаций[Индекс1] = ДанныеОрганизаций[Индекс2];
				ДанныеОрганизаций[Индекс2] = Временное;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПриоритетСортировкиОрганизации(СтрокаДанных)
	
	Если ИнформацияОБиллингеНедоступна(СтрокаДанных) Тогда
		Возврат 300;
	КонецЕсли;
	
	ПриоритетПроблемы = ПриоритетПроблемыОплатыОрганизации(СтрокаДанных.ДанныеБиллинга);
	
	Если ПриоритетПроблемы > 0 Тогда
		Возврат ПриоритетПроблемы;
	КонецЕсли;
	
	Возврат 1000;
	
КонецФункции

Функция ИнформацияОБиллингеНедоступна(СтрокаДанных)
	
	Если Не СтрокаДанных.ЕстьЗапись Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаДанных.ТекстОшибки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДанныеБиллинга = СтрокаДанных.ДанныеБиллинга;
	
	Если Не ДанныеБиллинга.Успешно Или ДанныеБиллинга.ИнформацияНедоступна Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура УстановитьШиринуКолонокТабличногоДокументаПодписок(ТабДок)
	
	ТабДок.Область("C1").ШиринаКолонки = 4;
	ТабДок.Область("C2").ШиринаКолонки = 28;
	ТабДок.Область("C3").ШиринаКолонки = 18 * 1.2 + 10;
	ТабДок.Область("C4").ШиринаКолонки = 22;
	ТабДок.Область("C5").ШиринаКолонки = 24;
	
КонецПроцедуры

Функция ОбразецСтрокиТабличногоДокументаПодписок()
	
	ОбразецСтроки = Новый ТабличныйДокумент;
	УстановитьШиринуКолонокТабличногоДокументаПодписок(ОбразецСтроки);
	
	Возврат ОбразецСтроки;
	
КонецФункции

Функция ОбластьОбразцаСтроки(ОбразецСтроки)
	
	Возврат ОбразецСтроки.ПолучитьОбласть("R1C1:R1C5");
	
КонецФункции

Процедура ОчиститьОбразецСтрокиТабличногоДокументаПодписок(ОбразецСтроки)
	
	ОбластьСтроки = ОбразецСтроки.Область(1, 1, 1, 5);
	ОбластьСтроки.Разъединить();
	
	Для НомерКолонки = 1 По 5 Цикл
		
		Область = ОбразецСтроки.Область(1, НомерКолонки, 1, НомерКолонки);
		Область.Текст = "";
		Область.Расшифровка = Неопределено;
		Область.Гиперссылка = Ложь;
		Область.Картинка = Новый Картинка;
		Область.Шрифт = ШрифтТабличногоДокументаПодписокОбычный();
		Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ШрифтТабличногоДокументаПодписокОбычный()
	
	Возврат Новый Шрифт(,, Ложь);
	
КонецФункции

Процедура ВывестиПустуюСтрокуМеждуБлокамиОрганизаций(ТабДок, ОбразецСтроки)
	
	ОчиститьОбразецСтрокиТабличногоДокументаПодписок(ОбразецСтроки);
	ТабДок.Вывести(ОбластьОбразцаСтроки(ОбразецСтроки));
	
КонецПроцедуры

Процедура ВывестиБлокОрганизацииВТабличныйДокумент(ТабДок, ОбразецСтроки, СтрокаДанных)
	
	ОчиститьОбразецСтрокиТабличногоДокументаПодписок(ОбразецСтроки);
	
	ОбластьЗаголовка = ОбразецСтроки.Область(1, 1, 1, 5);
	ОбластьЗаголовка.Объединить();
	ОбластьЗаголовка.Текст = СтрокаДанных.ПредставлениеОрганизации;
	ОбластьЗаголовка.Шрифт = Новый Шрифт(ШрифтТабличногоДокументаПодписокОбычный(), , , Истина);
	ОбластьЗаголовка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	ОбластьЗаголовка.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ТабДок.Вывести(ОбластьОбразцаСтроки(ОбразецСтроки), 0);
	
	СведенияЛицевогоСчета = СведенияЛицевогоСчетаДляОтображения(СтрокаДанных);
	ВывестиСтрокуСтатусаВТабличныйДокумент(ТабДок, ОбразецСтроки,
		СведенияЛицевогоСчета, "Лицевой счет", СтрокаДанных);
	
	СведенияЛицензии = СведенияЛицензииДляОтображения(СтрокаДанных);
	ВывестиСтрокуСтатусаВТабличныйДокумент(ТабДок, ОбразецСтроки,
		СведенияЛицензии, "Лицензия Модуль 1С: Логистика", СтрокаДанных);
	
	СведенияПакета = СведенияПакетаДокументовДляОтображения(СтрокаДанных);
	ВывестиСтрокуСтатусаВТабличныйДокумент(ТабДок, ОбразецСтроки,
		СведенияПакета, "Пакет документов", СтрокаДанных);
	
КонецПроцедуры

Процедура ВывестиСтрокуСтатусаВТабличныйДокумент(ТабДок, ОбразецСтроки, СведенияСтроки, ЗаголовокСтроки, СтрокаДанных)
	
	ОчиститьОбразецСтрокиТабличногоДокументаПодписок(ОбразецСтроки);
	
	ОбластьИконки = ОбразецСтроки.Область(1, 1, 1, 1);
	ОформитьОбластьИконкиПодписокИОплаты(ОбластьИконки,
		КартинкаСтатусаПодписокИОплаты(СведенияСтроки.УровеньСтатуса));
	
	ЗаполнитьТекстОбразцаСтроки(ОбразецСтроки, 2, 2, ЗаголовокСтроки);
	ЗаполнитьТекстОбразцаСтроки(ОбразецСтроки, 3, 3, СведенияСтроки.Значение);
	ЗаполнитьТекстОбразцаСтроки(ОбразецСтроки, 4, 4, СведенияСтроки.Статус);
	
	Если ЗначениеЗаполнено(СведенияСтроки.ТекстСсылки) Тогда
		РасшифровкаСсылки = РасшифровкаГиперссылкиОплаты(СтрокаДанных,
			СведенияСтроки.ТекстСсылки, СведенияСтроки.РасшифровкаСсылки);
		ЗаполнитьГиперссылкуОбразцаСтроки(ОбразецСтроки, 5,
			СведенияСтроки.ТекстСсылки, РасшифровкаСсылки);
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьОбразцаСтроки(ОбразецСтроки), 1);
	
КонецПроцедуры

Процедура ЗаполнитьТекстОбразцаСтроки(ОбразецСтроки, НомерКолонкиНачало, НомерКолонкиКонец, Текст)
	
	Область = ОбразецСтроки.Область(1, НомерКолонкиНачало, 1, НомерКолонкиКонец);
	
	Если НомерКолонкиНачало <> НомерКолонкиКонец Тогда
		Область.Объединить();
	КонецЕсли;
	
	Область.Текст = Текст;
	Область.Шрифт = ШрифтТабличногоДокументаПодписокОбычный();
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	Область.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	
КонецПроцедуры

Процедура ЗаполнитьГиперссылкуОбразцаСтроки(ОбразецСтроки, НомерКолонки, Текст, Расшифровка)
	
	Область = ОбразецСтроки.Область(1, НомерКолонки, 1, НомерКолонки);
	Область.Текст = Текст;
	Область.Расшифровка = Расшифровка;
	Область.Гиперссылка = Истина;
	Область.ЦветТекста = WebЦвета.Синий;
	Область.Шрифт = Новый Шрифт(ШрифтТабличногоДокументаПодписокОбычный(), , , , , Истина);
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	Область.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	
КонецПроцедуры

Процедура ВывестиПодвалПомощиВТабличныйДокумент(ТабДок, ОбразецСтроки)
	
	ОчиститьОбразецСтрокиТабличногоДокументаПодписок(ОбразецСтроки);
	
	ОбластьИконки = ОбразецСтроки.Область(1, 1, 1, 1);
	ОформитьОбластьИконкиПодписокИОплаты(ОбластьИконки,
		БиблиотекаКартинок.КонтурЛогистика_ЗнакВопросаСинийВРамке);
	
	ЗаполнитьГиперссылкуОбразцаСтроки(ОбразецСтроки, 2, "Нужна помощь", РасшифровкаЦентраПоддержки());
	
	ОбластьСсылки = ОбразецСтроки.Область(1, 2, 1, 2);
	ОбластьСсылки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	
	ТабДок.Вывести(ОбластьОбразцаСтроки(ОбразецСтроки));
	
КонецПроцедуры

Процедура ОформитьОбластьИконкиПодписокИОплаты(ОбластьИконки, Картинка)
	
	ОбластьИконки.Картинка = Картинка;
	ОбластьИконки.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
	ОбластьИконки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьИконки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	
КонецПроцедуры

Функция КартинкаСтатусаПодписокИОплаты(УровеньСтатуса)
	
	Если УровеньСтатуса = "Ошибка" Тогда
		Возврат БиблиотекаКартинок.КонтурЛогистика_ПунктОшибка;
	ИначеЕсли УровеньСтатуса = "Предупреждение" Тогда
		Возврат БиблиотекаКартинок.КонтурЛогистика_ВосклицаниеОранжевое;
	КонецЕсли;
	
	Возврат БиблиотекаКартинок.КонтурЛогистика_ГалочкаЗеленая;
	
КонецФункции

Функция НовыеСведенияСтрокиОтображения()
	
	Результат = Новый Структура;
	Результат.Вставить("УровеньСтатуса", "ОК");
	Результат.Вставить("Значение", "");
	Результат.Вставить("Статус", "");
	Результат.Вставить("ТекстСсылки", "");
	Результат.Вставить("РасшифровкаСсылки", "");
	
	Возврат Результат;
	
КонецФункции

Функция СведенияНедоступнойИнформации(ТекстСсылки, РасшифровкаСсылки)
	
	Результат = НовыеСведенияСтрокиОтображения();
	Результат.УровеньСтатуса = "Предупреждение";
	Результат.Статус = "Информация недоступна";
	Результат.ТекстСсылки = ТекстСсылки;
	Результат.РасшифровкаСсылки = РасшифровкаСсылки;
	
	Возврат Результат;
	
КонецФункции

Функция СведенияЛицевогоСчетаДляОтображения(СтрокаДанных)
	
	Если ИнформацияОБиллингеНедоступна(СтрокаДанных) Тогда
		Возврат СведенияНедоступнойИнформации("", "");
	КонецЕсли;
	
	ЛицевойСчет = СтрокаДанных.ДанныеБиллинга.ЛицевойСчет;
	Результат = НовыеСведенияСтрокиОтображения();
	
	Если ЗначениеЗаполнено(ЛицевойСчет.AccountId) Тогда
		Результат.Значение = ЛицевойСчет.AccountId;
	КонецЕсли;
	
	Если ЛицевойСчетПроблемный(ЛицевойСчет) Тогда
		Результат.УровеньСтатуса = "Ошибка";
		Результат.Статус = "Заблокирован";
	Иначе
		Результат.УровеньСтатуса = "ОК";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СведенияЛицензииДляОтображения(СтрокаДанных)
	
	ТекстСсылки = "Продлить лицензию";
	РасшифровкаСсылки = СсылкаПродленияЛицензии();
	
	Если ИнформацияОБиллингеНедоступна(СтрокаДанных) Тогда
		Возврат СведенияНедоступнойИнформации(ТекстСсылки, РасшифровкаСсылки);
	КонецЕсли;
	
	Лицензия = СтрокаДанных.ДанныеБиллинга.Лицензия;
	Результат = НовыеСведенияСтрокиОтображения();
	Результат.ТекстСсылки = ТекстСсылки;
	Результат.РасшифровкаСсылки = РасшифровкаСсылки;
	
	Если Не Лицензия.ЕстьЛицензия Или Лицензия.НеДействует Тогда
		Результат.УровеньСтатуса = "Ошибка";
		Результат.Статус = "Не действует";
	Иначе
		
		Результат.Статус = ПредставлениеДатыДо(Лицензия.ДатаОкончания);
		
		Если Лицензия.ДнейДоОкончания <= 45 И Лицензия.ДнейДоОкончания >= 0 Тогда
			Результат.УровеньСтатуса = "Предупреждение";
		Иначе
			Результат.УровеньСтатуса = "ОК";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СведенияПакетаДокументовДляОтображения(СтрокаДанных)
	
	ТекстСсылки = "Оплатить пакет документов";
	РасшифровкаСсылки = СсылкаОплатыПакетаДокументов();
	
	Если ИнформацияОБиллингеНедоступна(СтрокаДанных) Тогда
		Возврат СведенияНедоступнойИнформации(ТекстСсылки, РасшифровкаСсылки);
	КонецЕсли;
	
	Пакет = СтрокаДанных.ДанныеБиллинга.ПакетДокументов;
	Результат = НовыеСведенияСтрокиОтображения();
	Результат.ТекстСсылки = ТекстСсылки;
	Результат.РасшифровкаСсылки = РасшифровкаСсылки;
	
	ПриоритетПакета = ПриоритетПроблемыПакетаДокументов(Пакет);
	
	Если Пакет.ЕстьПакет Тогда
		
		Если ПриоритетПакета = 4 Тогда
			Результат.Значение = "Документы закончились";
		Иначе
			Результат.Значение = КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок(
				"Осталось %1 документов", Формат(Пакет.Остаток, "ЧГ=0"));
		КонецЕсли;
		
		Результат.Статус = ПредставлениеДатыДо(Пакет.ДатаОкончания);
		
	ИначеЕсли ПриоритетПакета = 3 Тогда
		Результат.Значение = "Нет пакета документов";
	КонецЕсли;
	
	Если ПриоритетПакета = 3 Или ПриоритетПакета = 4 Тогда
		Результат.УровеньСтатуса = "Ошибка";
	ИначеЕсли ПриоритетПакета = 6 Или ПриоритетПакета = 7 Тогда
		Результат.УровеньСтатуса = "Предупреждение";
	Иначе
		Результат.УровеньСтатуса = "ОК";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеДатыДо(Дата)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "до " + Формат(Дата, "ДЛФ=D");
	
КонецФункции

Функция ПредставленияОрганизацийДляТекстаБаннера(Организации)
	
	Представления = Новый Массив;
	
	Для Каждого Организация Из Организации Цикл
		Представления.Добавить(Строка(Организация));
	КонецЦикла;
	
	Возврат Представления;
	
КонецФункции

Функция РасшифровкаГиперссылкиОплаты(СтрокаДанных, ТекстСсылки, URL)
	
	Возврат КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("ПодпискиИОплата|%1|%2|%3",
		ТекстСсылки,
		BoxIdОрганизации(СтрокаДанных.Организация),
		URL);
	
КонецФункции

// Разбирает расшифровку гиперссылки оплаты, сформированную РасшифровкаГиперссылкиОплаты().
//
// Параметры:
//  Расшифровка - Строка
//
// Возвращаемое значение:
//  Структура, Неопределено - ТекстСсылки, BoxID, URL
//
Функция РазобратьРасшифровкуГиперссылкиОплаты(Расшифровка) Экспорт
	
	Префикс = "ПодпискиИОплата|";
	
	Если ТипЗнч(Расшифровка) <> Тип("Строка")
		Или Не КонтурЛогистика_СтдСтрКлиентСервер.СтрНачинаетсяСЛок(Расшифровка, Префикс) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Остаток = Сред(Расшифровка, СтрДлина(Префикс) + 1);
	
	ПозицияТекста = КонтурЛогистика_СтдСтрКлиентСервер.СтрНайтиЛок(Остаток, "|");
	
	Если ПозицияТекста = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстСсылки = Лев(Остаток, ПозицияТекста - 1);
	Остаток = Сред(Остаток, ПозицияТекста + 1);
	
	ПозицияBoxId = КонтурЛогистика_СтдСтрКлиентСервер.СтрНайтиЛок(Остаток, "|");
	
	Если ПозицияBoxId = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	BoxID = Лев(Остаток, ПозицияBoxId - 1);
	URL = Сред(Остаток, ПозицияBoxId + 1);
	
	Если Не ЗначениеЗаполнено(URL) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстСсылки", ТекстСсылки);
	Результат.Вставить("BoxID", BoxID);
	Результат.Вставить("URL", URL);
	
	Возврат Результат;
	
КонецФункции

#Область Метрики

Функция КатегорияМетрикПодписокИОплаты()
	
	Возврат "Подписки и оплаты";
	
КонецФункции

Функция ПредставлениеФормыПодписокИОплатыМетрики()
	
	Возврат "Новая форма ""Подписки и оплаты""";
	
КонецФункции

Функция ПредставлениеРабочегоСтолаМетрики()
	
	Возврат "КонтурЛогистика_РабочийСтол.Форма";
	
КонецФункции

Функция BoxIdОрганизации(Организация)
	
	Возврат КонтурЛогистика_СтдОбщегоНазначения.ЗначениеРеквизитаОбъектаЛок(Организация, "ID");
	
КонецФункции

Функция МассивBoxIdОрганизаций(Организации)
	
	Результат = Новый Массив;
	
	Для Каждого Организация Из Организации Цикл
		
		BoxId = BoxIdОрганизации(Организация);
		
		Если ЗначениеЗаполнено(BoxId) Тогда
			Результат.Добавить(BoxId);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗарегистрироватьМетрикуПоказаБаннераПодписокИОплаты(НомерСценария, Организации) Экспорт
	
	Переменные = Новый Структура;
	Переменные.Вставить("BoxID", МассивBoxIdОрганизаций(Организации));
	
	КонтурЛогистика_Метрика.ЗарегистрироватьСтатистику(
		Переменные,
		КатегорияМетрикПодписокИОплаты(),
		"Показ баннера",
		ПредставлениеРабочегоСтолаМетрики(),
		Строка(НомерСценария));
	
КонецПроцедуры

Процедура ЗарегистрироватьМетрикуОшибкиБаннераПодписокИОплаты(СтрокаДанных)
	
	ДопИнформация = Новый Структура;
	ДопИнформация.Вставить("BoxID", BoxIdОрганизации(СтрокаДанных.Организация));
	ДопИнформация.Вставить("ТекстОшибкиAPI", СтрокаДанных.ТекстОшибки);
	
	КонтурЛогистика_Метрика.ОбработатьОшибку(
		КатегорияМетрикПодписокИОплаты(),
		СтрокаДанных.ТекстОшибки,
		СтрокаДанных.Организация,
		ДопИнформация,
		ПредставлениеРабочегоСтолаМетрики(),
		Ложь);
	
КонецПроцедуры

Процедура ЗарегистрироватьМетрикуПереходаВПодпискиИзБаннера() Экспорт
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		КатегорияМетрикПодписокИОплаты(),
		"Перейти в Подписки из баннера",
		ПредставлениеРабочегоСтолаМетрики());
	
КонецПроцедуры

Процедура ЗарегистрироватьМетрикуПереходаВПодпискиИзНастроек() Экспорт
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		КатегорияМетрикПодписокИОплаты(),
		"Перейти в Подписки из Настройки",
		ПредставлениеРабочегоСтолаМетрики());
	
КонецПроцедуры

Процедура ЗарегистрироватьМетрикуОтбораОрганизацииНаФорме(ОрганизацияОтбор) Экспорт
	
	ОрганизацииОтбора = Новый Массив;
	
	Если ЗначениеЗаполнено(ОрганизацияОтбор) Тогда
		ОрганизацииОтбора.Добавить(ОрганизацияОтбор);
	Иначе
		Для Каждого Организация Из АвторизованныеОрганизации() Цикл
			ОрганизацииОтбора.Добавить(Организация);
		КонецЦикла;
	КонецЕсли;
	
	Переменные = Новый Структура;
	Переменные.Вставить("BoxID", МассивBoxIdОрганизаций(ОрганизацииОтбора));
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		КатегорияМетрикПодписокИОплаты(),
		"Отбор по организации",
		ПредставлениеФормыПодписокИОплатыМетрики(),,,
		Переменные);
	
КонецПроцедуры

Процедура ЗарегистрироватьМетрикуРезультатаЗапросаФормыПодписокИОплаты(ОтчетСинхронизации) Экспорт
	
	Переменные = Новый Структура;
	Переменные.Вставить("Count", ОтчетСинхронизации.Всего);
	Переменные.Вставить("Time", ОтчетСинхронизации.ВремяМс);
	Переменные.Вставить("Status", СтатусМетрикиСинхронизацииПодписокИОплаты(ОтчетСинхронизации));
	
	КонтурЛогистика_Метрика.ЗарегистрироватьСтатистику(
		Переменные,
		КатегорияМетрикПодписокИОплаты(),
		"Запрос в биллинг",
		ПредставлениеФормыПодписокИОплатыМетрики());
	
	Для Каждого ОшибкаСинхронизации Из ОтчетСинхронизации.Ошибки Цикл
		ЗарегистрироватьМетрикуОшибкиЗапросаФормыПодписокИОплаты(ОшибкаСинхронизации);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьМетрикуПереходаПоГиперссылкеОплаты(Расшифровка) Экспорт
	
	ДанныеСсылки = РазобратьРасшифровкуГиперссылкиОплаты(Расшифровка);
	
	Если ДанныеСсылки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДанных = СтрокаДанныхОрганизацииДляМетрикПоBoxId(ДанныеСсылки.BoxID);
	Переменные = ПеременныеМетрикиСостоянияПодписокОрганизации(СтрокаДанных);
	МеткаСсылки = КонтурЛогистика_СтдСтрКлиентСервер.СтрШаблонЛок("Гиперссылка ""%1""", ДанныеСсылки.ТекстСсылки);
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		КатегорияМетрикПодписокИОплаты(),
		"Продление",
		ПредставлениеФормыПодписокИОплатыМетрики(),
		МеткаСсылки,,
		Переменные);
	
КонецПроцедуры

Процедура ЗарегистрироватьМетрикуПомощиНаФормеПодписокИОплаты() Экспорт
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя(
		КатегорияМетрикПодписокИОплаты(),
		"Помощь в Подписки и оплата",
		ПредставлениеФормыПодписокИОплатыМетрики());
	
КонецПроцедуры

Процедура ЗарегистрироватьМетрикуОшибкиЗапросаФормыПодписокИОплаты(ОшибкаСинхронизации)
	
	ДопИнформация = Новый Структура;
	ДопИнформация.Вставить("BoxID", ОшибкаСинхронизации.BoxId);
	
	Если ЗначениеЗаполнено(ОшибкаСинхронизации.КодСостояния) Тогда
		ДопИнформация.Вставить("Код", ОшибкаСинхронизации.КодСостояния);
	КонецЕсли;
	
	КонтурЛогистика_Метрика.ОбработатьОшибку(
		КатегорияМетрикПодписокИОплаты(),
		ОшибкаСинхронизации.ТекстОшибки,
		ОшибкаСинхронизации.Организация,
		ДопИнформация,
		ПредставлениеФормыПодписокИОплатыМетрики(),
		Ложь);
	
КонецПроцедуры

Функция СтатусМетрикиСинхронизацииПодписокИОплаты(ОтчетСинхронизации)
	
	Если ОтчетСинхронизации.Всего = 0 Тогда
		Возврат "SUCCESS";
	КонецЕсли;
	
	Если ОтчетСинхронизации.Успешно = ОтчетСинхронизации.Всего Тогда
		Возврат "SUCCESS";
	КонецЕсли;
	
	Если ОтчетСинхронизации.Ошибка = ОтчетСинхронизации.Всего Тогда
		Возврат "ERROR";
	КонецЕсли;
	
	Возврат "PART";
	
КонецФункции

Функция СтрокаДанныхОрганизацииДляМетрик(Организация)
	
	ДанныеОрганизаций = ПолучитьДанныеАвторизованныхОрганизаций(Организация);
	
	Если ДанныеОрганизаций.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеОрганизаций[0];
	
КонецФункции

Функция СтрокаДанныхОрганизацииДляМетрикПоBoxId(BoxId)
	
	Если Не ЗначениеЗаполнено(BoxId) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого Организация Из АвторизованныеОрганизации() Цикл
		
		Если BoxIdОрганизации(Организация) = BoxId Тогда
			Возврат СтрокаДанныхОрганизацииДляМетрик(Организация);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПеременныеМетрикиСостоянияПодписокОрганизации(СтрокаДанных)
	
	Переменные = Новый Соответствие;
	
	Если СтрокаДанных = Неопределено Тогда
		Возврат Переменные;
	КонецЕсли;
	
	ДанныеБиллинга = СтрокаДанных.ДанныеБиллинга;
	ЛицевойСчет = ДанныеБиллинга.ЛицевойСчет;
	Лицензия = ДанныеБиллинга.Лицензия;
	Пакет = ДанныеБиллинга.ПакетДокументов;
	
	Переменные.Вставить("BoxID", BoxIdОрганизации(СтрокаДанных.Организация));
	
	Если ЛицевойСчетПроблемный(ЛицевойСчет) Тогда
		Переменные.Вставить("Статус Л/C", "заблокирован");
	Иначе
		Переменные.Вставить("Статус Л/C", "активный");
	КонецЕсли;
	
	Если Лицензия.ЕстьЛицензия И Не Лицензия.НеДействует Тогда
		Переменные.Вставить("Лицензия 1С", "Да");
	Иначе
		Переменные.Вставить("Лицензия 1С", "Нет");
	КонецЕсли;
	
	Переменные.Вставить("Срок действия лицензии 1С", ПредставлениеДатыМетрики(Лицензия.ДатаОкончания));
	
	Если Пакет.ЕстьПакет Тогда
		Переменные.Вставить("Пакет документов", "Да");
	Иначе
		Переменные.Вставить("Пакет документов", "Нет");
	КонецЕсли;
	
	Переменные.Вставить("Остаток по пакету", Пакет.Остаток);
	Переменные.Вставить("Срок действия пакета", ПредставлениеДатыМетрики(Пакет.ДатаОкончания));
	
	Возврат Переменные;
	
КонецФункции

Функция ПредставлениеДатыМетрики(Дата)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Формат(Дата, "ДЛФ=D");
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
